In [1]:
import pandas as pd
import numpy as np

In [6]:
mylist = [5,4,33,12,76]
myarray = np.array(mylist)
print(myarray)

[ 5  4 33 12 76]

In [7]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5
1     4
2    33
3    12
4    76
dtype: int64
0     5
1     4
2    33
3    12
4    76
dtype: int32

In [5]:
print(myseries1[2])

3

In [8]:
mylables = ['1th','2th','3th','4th','5th']
myseries3 = pd.Series(data=mylist,index=mylables)
print(myseries3)

1th     5
2th     4
3th    33
4th    12
5th    76
dtype: int64

In [9]:
print(myseries3['3th'])

33

In [10]:
myseries4 = pd.Series([2,3,4,1,6],['1th','3th','4th','6th','7th'])
print(myseries4)
print('')
print(myseries3+myseries4)

1th    2
3th    3
4th    4
6th    1
7th    6
dtype: int64

1th     7.0
2th     NaN
3th    36.0
4th    16.0
5th     NaN
6th     NaN
7th     NaN
dtype: float64

In [16]:
df1 = pd.concat([myseries3,myseries4],axis=1,sort=True)
df1

        0    1
1th   5.0  2.0
2th   4.0  NaN
3th  33.0  3.0
4th  12.0  4.0
5th  76.0  NaN
6th   NaN  1.0
7th   NaN  6.0

# Modifying a DataFrame

In [18]:
df2 = pd.DataFrame(np.random.randn(5,5),index=['1th row','2th row','3th row','4th row','5th row'],columns=['1th col','2th col','3th col','4th col','5th col'])
df2

          1th col   2th col   3th col   4th col   5th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605
2th row  0.145061  1.774708  0.780958  0.996805  0.780980
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316

In [22]:
df2[['2th col','5th col']]

          2th col   5th col
1th row -0.516739 -0.582605
2th row  1.774708  0.780980
3th row -0.147782  0.713458
4th row  0.667603  0.801185
5th row  1.700104 -0.905316

In [25]:
df2.loc[['2th row' ,'4th row'],['1th col','3th col']]

          1th col   3th col
2th row  0.145061  0.780958
4th row -1.033275  0.286494

In [26]:
df2>0

         1th col  2th col  3th col  4th col  5th col
1th row     True    False     True    False    False
2th row     True     True     True     True     True
3th row     True    False    False    False     True
4th row    False     True     True    False     True
5th row     True     True    False     True    False

In [28]:
df2[df2>0]

          1th col   2th col   3th col   4th col   5th col
1th row  0.847794       NaN  0.250755       NaN       NaN
2th row  0.145061  1.774708  0.780958  0.996805  0.780980
3th row  0.662552       NaN       NaN       NaN  0.713458
4th row       NaN  0.667603  0.286494       NaN  0.801185
5th row  0.302512  1.700104       NaN  1.304873       NaN

In [29]:
df2['6th col'] = np.random.randn(5,1)
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [30]:
df2.drop('3th col',axis=1)

          1th col   2th col   4th col   5th col   6th col
1th row  0.847794 -0.516739 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104  1.304873 -0.905316 -0.319172

In [31]:
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [32]:
 df2.reset_index()

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [33]:
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [34]:
df2.reset_index(inplace=True)
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [35]:
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [36]:
df2['S/no']=['#','#','#','#','#']
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col S/no
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806    #
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623    #
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539    #
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538    #
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172    #

In [37]:
df2.set_index('S/no',inplace=True)
df2

        index   1th col   2th col   3th col   4th col   5th col   6th col
S/no
#     1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
#     2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
#     3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
#     4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
#     5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [38]:
df2.mean()

1th col    0.184929
2th col    0.695579
3th col   -0.170838
4th col    0.205212
5th col    0.161540
6th col   -0.204305
dtype: float64

# Combining DataFrames

<h2>Concat</h2>

In [40]:
df3 = pd.DataFrame({"Coustomer":['101','102','103','104'],'Category':['cat2','cat2','cat1','cat3'],'Important':['Y','N','Y','Y'],'Sales':[123,52,214,663]})
df4 = pd.DataFrame({"Coustomer":['101','103','103','105'],'Color':['yellow','green','green','blue'],'Distance':[12,9,44,21],'Sales':[123,214,663,331]})

In [42]:
pd.concat([df3,df4],axis=0,sort=True)

  Category   Color Coustomer  Distance Important  Sales
0     cat2     NaN       101       NaN         Y    123
1     cat2     NaN       102       NaN         N     52
2     cat1     NaN       103       NaN         Y    214
3     cat3     NaN       104       NaN         Y    663
0      NaN  yellow       101      12.0       NaN    123
1      NaN   green       103       9.0       NaN    214
2      NaN   green       103      44.0       NaN    663
3      NaN    blue       105      21.0       NaN    331

In [43]:
pd.concat([df3,df4],axis=1,sort=True)

  Coustomer Category Important  Sales Coustomer   Color  Distance  Sales
0       101     cat2         Y    123       101  yellow        12    123
1       102     cat2         N     52       103   green         9    214
2       103     cat1         Y    214       103   green        44    663
3       104     cat3         Y    663       105    blue        21    331

<h2>Merge and Join</h2>